In [39]:
import pandas as pd
import numpy as np

In [40]:
df=pd.DataFrame({
    'city':['London','NewYork','Japan','Mumbai','NewYork','Mumbai','London'],
    'price':[120,130,140,150,160,170,180]
})

In [41]:
df

      city  price
0   London    120
1  NewYork    130
2    Japan    140
3   Mumbai    150
4  NewYork    160
5   Mumbai    170
6   London    180

In [42]:
mean_data=df.groupby('city')['price'].mean().to_dict()

In [43]:
mean_data

{'Japan': 140.0, 'London': 150.0, 'Mumbai': 160.0, 'NewYork': 145.0}

In [44]:
df['city_encoded']=df['city'].map(mean_data)

In [45]:
df

      city  price  city_encoded
0   London    120         150.0
1  NewYork    130         145.0
2    Japan    140         140.0
3   Mumbai    150         160.0
4  NewYork    160         145.0
5   Mumbai    170         160.0
6   London    180         150.0

In [46]:
df.drop('city',axis=1,inplace=True)

In [47]:
df

   price  city_encoded
0    120         150.0
1    130         145.0
2    140         140.0
3    150         160.0
4    160         145.0
5    170         160.0
6    180         150.0